---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
source: html/47ee7f54-7e70-cc22-8f2e-d19fbd4a3617.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayLegendSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayLegendSettings(
	AnalysisDisplayLegendSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null